benchmark_results_replicated/20260423_101844/analysis/rep10/run/go_c25/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.22ms   33.34ms 187.23ms   78.97%
    Req/Sec   325.84     85.09     0.98k    69.33%
  Latency Distribution
     50%   13.70ms
     75%   58.58ms
     90%   82.22ms
     99%   99.31ms
  77918 requests in 1.00m, 9.51MB read
Requests/sec:   1297.43
Transfer/sec:    162.18KB
P95: 93440
P99: 99306